# synergy

________________________________________________________________
## Цель задания: Научиться создавать решения с простыми математическими
## задачами. Научиться самостоятельно разбираться в коде и ошибках.
# Задания 1:
 1. Выведите ваше имя в консоль
2. Выведите любимое стихотворение в консоль
3. Покажите в IDEA: Project explorer (область слева со списком файлов), область
   с кодом, номера строк кода. Окошко, в котором выводится результат программы.
   Скройте и выведите обратно project explorer.
4. Вывести значение 2 + 2 * 2
5. Вывести значение (2+2)*2
6. Вывести значение деления 100 на пи
7. Вывести значение 12345 в третьей степени
8. Вывести квадратный корень от двух в 10 степени
9. Вывести корень из двух, возведенный в 10 степень
10. Что будет, если в джаве поделить на ноль? Проверить
11. Попробуйте сложить две строки в Java. Выведите результат.
12. Попробуйте вычесть, разделить две строки.
13. Попробуйте сложить строку с числом пи. Что получилось?
14. Полезное упражнение: напишите программу, которая считает корень
    линейного уравнения ax+b=0
15. Полезное упражнение: напишите программу, которая считает корни
    уравнения (ax+b)*(cx+d)=0
16. Полезное упражнение: напишите программу, которая считает дискриминант
    квадратного уравнения
---------------------------------------------------------------------------------

# Задания 2:
 Практика программирования: переменные, ветвления, циклы. Введение в String API. 
 Использование готовых методов: 
 скачиваем веб-страницу, сохраняем в файл. 
 Цель задания: Разобраться в создании решений с ветвлениями, циклами, 
 переменными.
 ### Задания:
1. Если 5 в 15 степени больше миллиарда, вывести -«Степень это мощь. Power is a power.»
2. Задайте переменную. Если она больше 0, вывести «позитив», если меньше 0, вывести «отрицательно»
3. Если квадратный корень из 15 миллионов меньше 5 тысяч, вывести -«два измерения лучше, чем одно»
4. Если 2 в 10 степени меньше 512 вывести -«Pentium 2», иначе вывести -«ARM»
5. Задать две дробных переменных. Вывести наибольшую из них.
6. Задать две переменных -first и second. Вывести first в степени second, second в степени first. 
7. Задать две переменных -икс и игрек. Вывести, что больше -икс в степени игрек, или наоборот.
8. Вывести числа от 1 до 100
9. Вывести числа от 50 до 10010.
10. Вывести числа от 100 до 111. 
11. Вывести числа от 0 до -10012. 
12. Задать строковую переменную. Заменить в ней все буквы о на «обро»
13. Задать строковую переменную. Вывести ее в верхнем регистре.
14. Задать строковую переменную. Заменить в ней буквы а на @, а буквы о на 0.15. 
15. Задать две строковых переменных. Найти, какая из них длиннее. (Используйте .length() )
16. Задать три переменных, найти наибольшую из них
17. Напишите программу, сохраняющую в файл статью из википедии «Проблема 2000 года». Прочитайте её.
18. Напишите программу, сохраняющую в файл статью из википедии «Дональд Кнут». Перед сохранением в файл замените все слова Кнут на Пряник
19. Напишите программу, которая сохраняет в файл случайную статью из Википедии. (Ссылку на случайную статью можно найти на вики в меню слева: https://ru.wikipedia.org/wiki/%D0%A1%D0%BB%D1%83%D0%B6%D0%B5%D0%B1%D0%BD%D0%B0%D1%8F:%D0%A1%D0%BB%D1%83%D1%87%D0%B0%D0%B9%D0%BD%D0%B0%D1%8F_%D1%81%D1%82%D1%80%D0%B0%D0%BD%D0%B8%D1%86%D0%B0 )
20. Сложная. Напишите программу, которая сохраняет в разные файлы 50 случайных статей из Википедии. 
## Критерии оценивания:
1 балл-создан новый проект в IDE
2 балла -написан скелет кода для вывода данных
3 балла -выполнено более 60% заданий, имеется не более 5 критичных замечаний
4 балла -выполнено корректно более 80% технических заданий 
5 баллов -все технические задания выполнены корректно, в полном объеме.
Задание считается выполненным при условии, 
что слушатель получил оценку не менее 3 баллов

-----------------------------------------------------------------------------------------------
# Урок 3. Переменные. Оперативная память. Дебаг.
## Цель задания: Научится создавать решения с переменными. 
## Научится работать с готовыми решениями.

### Задания:
1. Где хранятся переменные? Сколько переменных можно задать впрограмме? Чем ограничен размер?
2. Пользователь вводит строку, выведите ее длину
3. Пользователь вводит две строки, выведите сумму их длин
4. Пользователь вводит три строки. Найти, какая из них короче всех.
5. Пользователь вводит три дробных числа. Вывести те из них, квадратный корень которых меньше2.
6. Пройдите в дебаге 
   программу:int x = 1;while (x>=-3) {System.out.print(x);x = x -1;}Сколько раз выводится икс?
7. Пройдите в дебаге программу:String str = “Hell”;while (str.length()<10) {str = str + “o”;}Сколько раз вызывается 
   метод str.length() ?
8. Пользователь вводит два числа. Разделить меньшее на большее и вывести результат.
9. Пользователь вводит строку. Используя substring, вывести первые 5 символов.
10. Считайте boolean-переменную. Если пользователь ввел true, вывести “истина”, иначе ничего не стоит выводить.
11. Пользователь вводит 3 числа. Сделайте три boolean переменных: есть ли среди введённых четное, есть ли среди 
    введённых отрицательное, есть ли число больше тысячи
12. Пользователь вводит три строки, используя .substring(0, x) выведите эти строки, обрезав те, что длиннее самой 
    короткой. Пример ввода: «повар», «поделка», «лампочка». Вывод: «повар», «подел», «лампо»
13. Мини-игра в слова. Первый игрок вводит слово. Потом второй игрок вводит два числа, с какого по какой символ 
    можно найти слово внутри исходного, используя substring. Потом первый игрок вводит два числа. Побеждает тот, чье слово длиннее. Пример:1: революционный2: 0 3 (вывод: рев)1: 7 13 (вывод: ионный)Победил игрок 1